In [2]:
import pandas as pd

# Create a dictionary with basic information
data = {'Name': ['John', 'Jane', 'Mike'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']}

# Create a dataframe from the dictionary
df = pd.DataFrame(data)

# Display the dataframe
df

   Name  Age      City
0  John   25  New York
1  Jane   30    London
2  Mike   35     Paris

In [8]:
df1 = df
df1.loc[df1['Name'] == 'John', 'Age'] = 26

In [9]:
display(df1)
display(df)

   Name  Age      City
0  John   26  New York
1  Jane   30    London
2  Mike   35     Paris

   Name  Age      City
0  John   26  New York
1  Jane   30    London
2  Mike   35     Paris

In [3]:
for i in range(0,10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [4]:
def func(a,b):
    a = 2
    b = 3

a = 0
b = 0
func(a,b)
print(a,' ',b)

0   0

In [6]:
[1:10:]

SyntaxError: invalid syntax (2917868192.py, line 1)